---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.ForwardIterator
source: html/e0f70e1e-f3b8-ad47-4715-ca71c47b28b2.htm
---
# Autodesk.Revit.DB.ParameterSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ParameterSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.